Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh44-45-v3.tmx
Source language: bo
Languages: en

source: རིགས་ཀྱི་བུ་ཁོ་མོ་རྣམ་པར་ཐར་པ་དེ་དང་ལྡན་པས་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་འདིའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་ཀྱི་འཛམ་བུའི་གླིང་ཐམས་ཅད་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་ལ་སྐྱེ་བས་རྣམ་པར་འཕྲུལ་པ་ཇི་སྙེད་ཅིག་ཡོད་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་པ་དེ་དག་ཐམས་ཅད་སོ་སོའི་མར་གྱུར་བ་སྟེ།
en: “Noble one, through possessing that liberation, I have become the mother of each one of all the bodhisattvas in their final existences who are the Bhagavat Vairocana’s miraculous manifestations of being born into the final existences of a bodhisattva in all the Jambudvīpas in all the world realms in this ocean of world realms.

source: བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ལྟོ་ན་གནས་པ་ཁོ་མོའི་ལྟོ་གཡས་པ་ནས་འབྱུང་ངོ་། །
en: All those bodhisattvas have resided in my belly and emerged from the right side of my belly.

source: རིགས་ཀྱི་བུ་སྐལ་བ་དང་ལྡན་པའི་གླིང་བཞི་པ་འདི་ཉིད་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་སུ་ཡང་། རྒྱལ་པོ་ཟས་གཙང་མའི་བཙུན་མོའི་རིགས་དང་ལྡན་པའི་ཚུལ་གྱིས་བྱང་ཆུབ་སེམས་དཔའ་དོན་གྲུབ། བྱང་ཆུབ་སེམས་དཔའ་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་རྒྱ་ཆེན་པོ་བསམ་གྱིས་མི་ཁྱབ་པས་བསྐྱེད་དོ། །
en: “Noble one, in the location of the great city of Kapilavastu in this fortunate four-continent world, as a queen in the family of King Śuddhodana, I gave birth to the bodhisattva Siddhārtha in an inconceivable, vast, miraculous manifestation of a bodhisattva’s birth.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་རྒྱལ་པོ་ཟས་གཙང་མའི་ཕོ་བྲང་ན་འདུག་འདུག་པ་ལས་བྱང་ཆུབ་སེམས་དཔའ་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོ་བའི་དུས་ལ་བབ་པ་དང་།
en: “Noble one, while I was living in the palace of King Śuddhodana, the time came for the bodhisattva to leave Tuṣita.

source: བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འོད་ཟེར་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡུམ་གྱི་ཡོན་ཏན་གྱི་དཀྱིལ་འཁོར་ལས་བྱུང་བའི་སྣང་བ་ཞེས་བྱ་བ་མང་པོ་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་ཡུམ་གྱི་ཡོན་ཏན་གྱི་རྒྱན་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་འཐོན་ནས། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བར་བྱས་ཏེ།
en: From all his pores, from each of his pores, shone many light rays, as numerous as the atoms in countless buddha realms, called the illumination that comes from the field of the qualities of the mothers of all tathāgatas, which were a display of the qualities of the mothers of all bodhisattvas.

source: ཁོ་མོའི་ལུས་ལ་ཤར་ནས། སྤྱི་བོ་མན་ཅད་བ་སྤུའི་བུ་ག་ཐམས་ཅད་དུ་འཕྲོས་པར་གྱུར་ཏོ། །
en: They illuminated all world realms and shone upon me, spreading through me from the crown of my head to all the pores of my body.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་མིང་གཅིག་ལ། བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་གྱི་རྣམ་པར་འཕྲུལ་བ་དང་།
en: “Noble one, in that way, the bodhisattva light rays with one name radiated various miraculous manifestations, displays, and liberations of the mothers of bodhisattvas.

source: རྒྱན་དང་རྣམ་པར་ཐར་བ་སྣ་ཚོགས་རབ་ཏུ་འགྱེད་པ་དེ་དག་ཁོ་མོའི་ལུས་སུ་དོང་མ་ཐག་ཏུ་དེའི་མོད་ལ་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་གྱིས་རྣམ་པར་དམིགས་པར་བྱས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པའི་ཚུལ་དང་རྒྱན་ཐམས་ཅད་ཡོངས་སུ་སྣང་བར་གྱུར་ཏོ། །
en: The instant that they entered my body, I perceived in my body the displays and modes of the miraculous births of all bodhisattvas, visible in the fields of the tips of the light rays from the bodhisattva.

source: ཁྱིམ་དང་འཁོར་ལ་ཡང་དེ་བཞིན་དུ་སྣང་བར་གྱུར་ཏོ། །
en: Their residences and their entourages also appeared in that way.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་དེ་དག་ཁོ་མོའི་ལུས་སུ་དོང་མ་ཐག་ཏུ་དེའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་གྱི་སྒོའི་དཀྱིལ་འཁོར་དེ་དག་གིས་བྱང་ཆུབ་སེམས་དཔའ་གང་དག་གི་སྐྱེ་བའི་ཚུལ་དང་། རྣམ་པར་འཕྲུལ་བ་རྣམ་པར་དམིགས་པར་བྱས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་མཐོང་བར་གྱུར་ཏེ།
en: “Noble one, in that way, the instant those light rays from the bodhisattva entered my body, the field of the tips of the light rays from the bodhisattva made visible to me the miracles and modes of the lives of bodhisattvas, and I saw them all.

source: དེ་དག་ཐམས་ཅད་ཀྱང་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་ནས། སེང་གེའི་གདན་ལ་བཞུགས་ཤིང་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་གྱིས་བསྐོར་ཏེ། འཇིག་རྟེན་གྱི་དབང་པོ་རྣམས་ཀྱིས་བསྐོར་ཅིང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་མང་པོ་མཐོང་ངོ་། །དེ་བཞིན་གཤེགས་པ་དེ་དག་གིས་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་མཛད་པའི་ཚེ།
en: I saw them all going to their bodhimaṇḍas, sitting on their lion thrones encircled by assembled entourages of bodhisattvas, encircled by lords of the world, and turning the wheel of the Dharma.

source: དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བསྙེན་བཀུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་དང་པོ་ཐུགས་བསྐྱེད་པ་དང་། སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་དང་བཅས་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། མྱ་ངན་ལས་འདའ་བའི་རྣམ་པར་འཕྲུལ་བ་དང་བཅས། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པའི་རྒྱན་དང་བཅས་པར་མཐོང་ངོ་། །
en: “I also saw those tathāgatas performing bodhisattva conduct in the past, all their service to tathāgatas, their first development of aspiration to enlightenment, the miracles of their birth, their complete enlightenment, their turning the wheel of the Dharma, the miraculous manifestation of their passing into nirvāṇa, and the display of their pure buddha realms.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྤྲུལ་པའི་དཀྱིལ་འཁོར་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོས་མཐོང་བར་གྱུར་ཏོ། །
en: “I also saw all the field of the emanations of those tathāgatas filling all the realms of phenomena in each instant.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་འོད་ཟེར་དེ་དག་དོང་མ་ཐག་ཏུ་ཁོ་མོའི་ལུས་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ལས་མངོན་པར་འཕགས་པར་གྱུར་ཏེ།
en: “Noble one, in that way, the instant those light rays from the bodhisattva entered my body, my own body became superior to those of all beings.

source: རུམ་ནམ་མཁའི་དབྱིངས་ལྟར་ཡངས་པར་གྱུར་ཀྱང་མིའི་ལུས་ལས་ལྷག་པར་ཡང་མི་སྣང་ངོ་། །
en: My womb became as vast as space, but my body did not appear to transcend being a human body.

source: ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། ཁང་ཁྱིམ་དང་རྒྱན་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ལུས་ཀྱི་ཁོངས་སུ་ཆུད་པ་དང་། ཁོ་མོའི་ལུས་སུ་ཤོང་བར་གྱུར་པར་སྣང་བར་གྱུར་ཏོ། །
en: “All the displays and residences of the wombs in which dwelled bodhisattvas in the ten directions appeared contained within my body.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོའི་ལུས་སུ་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། ཁང་ཁྱིམ་དང་རྒྱན་དང་ལོངས་སྤྱོད་བྱུང་བར་གྱུར་པ་དང་།
en: “Noble one, in that way, there appeared in my body the wombs in which the bodhisattvas resided, together with their residences and their enjoyments.

source: དེའི་མོད་ལ་བྱང་ཆུབ་སེམས་དཔའ་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་གཅིག་པ་སྐལ་བ་མཉམ་པར་སྤྱོད་སྤྱོད་པ། དགེ་བའི་རྩ་བ་གཅིག་པ་རྒྱན་གཅིག་པ། རྣམ་པར་ཐར་པ་གཅིག་ལ་རྣམ་པར་སྤྱོད་པ། ཡེ་ཤེས་ཀྱིས་གཅིག་ལ་གནས་པ། རྣམ་པར་འཕྲུལ་པ་གཅིག་གིས་བྱུང་བ། སྨོན་ལམ་གཅིག་གིས་གྲུབ་པ། སྤྱོད་པ་གཅིག་གིས་བྱུང་བ། ཆོས་ཀྱི་ལུས་ཡོངས་སུ་དག་པ། གཟུགས་ཀྱི་ལུས་མཐའ་དང་དབུས་མེད་པའི་བྱིན་གྱི་རླབས་དང་ལྡན་པ། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་དང་རྣམ་པར་འཕྲུལ་པས་བྱུང་བ་དག་དང་། རིན་པོ་ཆེའི་ཀླུའི་དབང་པོའི་སྙིང་པོའི་ཁང་པ་བརྩེགས་པ་ན་འཁོད་ཅིང་།
en: In that instant, the bodhisattva and bodhisattvas as numerous as the atoms in ten buddha realms who had the same prayer, the same practice of conduct, the same roots of merit, the same displays; who were dwelling in the same liberation, residing on the same level of wisdom, coming forth through the same miraculous manifestations, accomplishing the same prayers, coming forth through the same conduct; having purified Dharma bodies and the powerful presence of a vast, centerless, endless extent, of form bodies coming forth through the completely good bodhisattva conduct, prayers, and miraculous manifestations, were seated in the center of the precious kūṭāgāras of the lords of nāgas.

source: ཀླུའི་རྒྱལ་པོ་གང་ཆེན་མཚོ་ལ་སྩོགས་པ་ཀླུའི་དབང་པོ་སྟོང་ཕྲག་བརྒྱད་ཅུ་དང་། འཇིག་རྟེན་གྱི་དབང་པོ་ཐམས་ཅད་ཀྱིས་ཀྱང་མངོན་པར་མཆོད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་བ་དགའ་ལྡན་གྱི་ཕོ་བྲང་ཐམས་ཅད་ནས་ཤི་འཕོ་ཡོངས་སུ་སྟོན་པས།
en: The nāga king Sāgara and eighty thousand other nāga kings and all lords of the world made offerings to them.

source: དགའ་ལྡན་གྱི་གནས་རེ་རེ་ནས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་འདལ་བའི་གླིང་བཞི་པར་སྐྱེ་བ་ལེན་པ་ཡོངས་སུ་སྟོན་པ། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཐབས་ཀྱི་ཚུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་མཁས་པའི་རྗེས་སུ་སོང་བ་དང་སེམས་ཅན་བག་མེད་པ་ཐམས་ཅད་ཡོངས་སུ་བསྐུལ་ཞིང་མངོན་པར་ཞེན་པ། ཐམས་ཅད་ལས་གྱེན་དུ་བསྐྱོད་པ་དང་། འོད་ཟེར་གྱི་དྲ་བ་ཆེན་པོ་རབ་ཏུ་དགྱེ་བས་འཇིག་རྟེན་གྱི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། ངན་སོང་ཐམས་ཅད་ཀྱི་སྡུག་བསྔལ་ཞི་བར་བྱེད་པ་དང་། སེམས་ཅན་དམྱལ་བའི་ལམ་གྱི་རྒྱུད་ཐམས་ཅད་ནས་རྣམ་པར་བཟློག་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྔོན་གྱི་ལས་ཡོངས་སུ་བསྐུལ་བ་དང་། སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྐྱོབ་པ་དང་།
en: “They displayed the miraculous manifestations of passing away from all the Tuṣita palaces, displayed taking birth from each Tuṣita into a four-continent world throughout all the world realms, acted in accordance with their skill in the inconceivable methods for ripening beings, inspired beings who were careless, brought them up out of all attachments, spread a great network of light rays that dispelled the darkness in all worlds, ended the sufferings in all lower existences, prevented all existences in hells, invoked the past karma of all beings, protected all realms of beings, and displayed their bodies to all beings.

source: སེམས་ཅན་ཐམས་ཅད་ལ་ལུས་མངོན་པར་སྟོན་པས་དགའ་ལྡན་གྱི་ཕོ་བྲང་ནས་འཕོས་ཏེ།
en: “Together they departed from their Tuṣita palaces and with their entourages entered my body.

source: འཁོར་དང་བཅས་པར་ཁོ་མོའི་ལུས་སུ་ཞུགས་ནས་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་ཁོང་ན་གོམ་པ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཙམ་དུ་ཡངས་པ་ནས། འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་དུ་ཡངས་པའི་འགྲོས་ཀྱིས་རྒྱུ་ཞིང་སྤྱོད་དོ། །
en: All of them moved and walked within my body, their steps ranging from being as wide as a great world realm of a thousand million worlds up to being as wide as world realms as numerous as the atoms in countless buddha realms.

source: ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཞབས་ཀྱི་དྲུང་གི་བྱང་ཆུབ་སེམས་དཔའི་འཁོར་གྱི་དཀྱིལ་འཁོར་བརྗོད་དུ་མེད་པ་དག་ཀྱང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་མངལ་གྱི་གནས་དང་། རྣམ་པར་འཕྲུལ་པ་ལྟ་བའི་ཕྱིར་ཁོ་མོའི་ཁོང་དུ་འདོང་ངོ་། །
en: “The countless assembled entourages of bodhisattvas at the feet of tathāgatas in all the vast extent of world realms in the ten directions in each instant came into my body in order to see the miraculous manifestation of the bodhisattva’s residence in the womb.

source: རྒྱལ་པོ་ཆེན་པོ་བཞི་དང་། བརྒྱ་བྱིན་དང་རབ་མཚེ་མ་དང་རབ་དགའ་ལྡན་དང་རབ་འཕྲུལ་དགའ་དང་དབང་བསྒྱུར་གྱི་ལྷའི་དབང་པོ་རྣམས་དང་། ཚངས་པ་རྣམས་ཀྱང་མངལ་གྱི་གནས་ན་བཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་ལ་ལྟ་བ་དང་། ཕྱག་བྱ་བ་དང་།
en: “The Four Mahārājas, Śakra, Suyāma, Saṃtuṣita, Sunirmita, Vaśavartin, the lords of the devas, and the lords of Brahmā devas also entered in order to see the bodhisattva dwelling in a womb, to pay homage to him, honor him, and hear him speak the Dharma.

source: བསྙེན་བཀུར་བ་དང་། ཆོས་མཉན་པའི་གཏམ་ཉམས་སུ་མྱོང་བར་བྱ་བའི་ཕྱིར་ཉེ་བར་དོང་ཡང་ཁོ་མོའི་རུམ་འདིས་དེ་སྙེད་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ཅིག་ཡོངས་སུ་བཟུང་ཡང་ཡངས་པར་གྱུར་པ་ཡང་མེད།
en: My womb, although it held all those assembled entourages, did not become vast.

source: མིའི་ལུས་ཐ་མལ་པ་ལས་ཁོ་མོའི་ལུས་ཁྱད་པར་ཅན་དུ་གྱུར་བ་ཡང་མེད་མོད་ཀྱི། འཁོར་གྱི་དཀྱིལ་འཁོར་དེ་སྙེད་ཀྱང་ཡོངས་སུ་བཟུང་ངོ་། །
en: My body was not different from an ordinary human body, and yet it held all those assembled entourages.

source: ལྷ་དང་མི་དེ་དག་ཐམས་ཅད་ཀྱིས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་སྣ་ཚོགས་དང་། རྒྱན་ཡོངས་སུ་དག་པ་ཡང་མཐོང་བར་གྱུར་ཏོ། །
en: “All those devas and humans saw the bodhisattva’s various pure enjoyments and displays.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་འདི་ཉིད་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་རོ། །
en: Because I meditated on this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ཁོ་མོ་སྐལ་བ་དང་ལྡན་པའི་གླིང་བཞི་པ་འདིའི་འཛམ་བུའི་གླིང་ན་བྱང་ཆུབ་སེམས་དཔའ་ཁོང་ན་ཡོངས་སུ་འཛིན་པ་དེ་བཞིན་དུ་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཀྱི་གླིང་བཞི་པ་ཐམས་ཅད་ཀྱི་འཛམ་བུའི་གླིང་དག་ན་ཡང་རྣམ་པར་འཕྲུལ་པའི་རྒྱན་གྱི་ཚུལ་འདི་ཉིད་ཀྱིས་ཡོངས་སུ་འཛིན་པར་བྱེད་དེ།
en: “Noble one, just as I held in my body the bodhisattva in the Jambudvīpa of this fortunate four-continent world, in the same way I have held him in this miraculous manner in all the four-continent worlds of the great world realm of a thousand million worlds.

source: བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་བ་སྨོན་ལམ་ཆེན་པོའི་ཡེ་ཤེས་སྒྱུ་མའི་རྣམ་པ་འདི་ཉིད་ཤིན་ཏུ་བསྒོམས་པའི་ཕྱིར་ཁོ་མོའི་ལུས་འདི་གཉིས་སུ་གྱུར་པའང་མེད། མི་གཉིས་པའང་མེད། གཅིག་ལ་གནས་པ་ཡང་མེད། མང་པོ་ལ་གནས་པ་ཡང་མེད་དོ། །
en: Because I have meditated on this bodhisattva liberation called the illusory conjurations of the wisdom of great prayer, my body is neither dual nor nondual, and it is neither single nor multiple.

source: རིགས་ཀྱི་བུ་ཇི་ལྟར་ཁོ་མོ་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་འདིའི་ཡུམ་དུ་གྱུར་པ་དེ་བཞིན་དུ་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་མཐའ་དང་དབུས་མེད་པ་དག་གི་ཡང་ཡུམ་དུ་གྱུར་ཏོ། །
en: “Noble one, just as I have been the mother of this Buddha Vairocana, in the same way I have been the mother of a vast extent, without middle or end, of past tathāgatas.

source: ལ་ལ་ཞིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་པད་མོའི་སྦུབས་ནས་རྫུས་ཏེ་སྐྱེ་བ་ཞིག་ཏུ་གྱུར་ན་ཡང་པད་མོའི་ཚལ་གྱི་ལྷ་མོར་གྱུར་ཅིང་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའ་ལེན་ཏེ། འཇིག་རྟེན་རྣམས་ཀྱིས་ཀྱང་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་ཡིན་པར་ཤེས་སོ། །
en: If a bodhisattva was born miraculously from the center of a lotus, I was a goddess of that lotus bed, I acquired that bodhisattva, and I was known in the world as being the bodhisattva’s mother.

source: ལ་ལ་ཞིག་ཏུ་ཐུ་བར་སྐྱེ་བར་གྱུར་ན་ཡང་དེ་དག་ཏུ་ཡང་ཁོ་མོས་ཐུ་བར་བླངས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་ཏོ། །
en: If a bodhisattva was born upon my lap, I acquired them from my lap and was the bodhisattva’s mother.

source: ལ་ལ་ཞིག་ཏུ་སངས་རྒྱས་ཀྱི་ཞིང་དུ་དེ་བཞིན་འབྱུང་བར་གྱུར་ན་ཡང་དེ་དག་ཏུ་འང་ཁོ་མོ་སྙིང་པོ་བྱང་ཆུབ་ཀྱི་ལྷ་མོར་གནས་གནས་སོ། །
en: If a bodhisattva were in that way born spontaneously in a buddha realm, I would be living there as the goddess of the bodhimaṇḍa.

source: རིགས་ཀྱི་བུ་ཐབས་ཀྱི་སྒོ་ཇི་སྙེད་ཅིག་གིས་བྱང་ཆུབ་སེམས་དཔའི་སྲིད་པའི་ཐ་མ་བ་འཇིག་རྟེན་དུ་འབྱུང་བ་ཡོངས་སུ་སྟོན་པ་དེ་སྙེད་ཀྱི་ཐབས་ཀྱི་སྒོས་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་གྱུར་ཏེ།
en: “Noble one, through various methods I became the mother of the bodhisattvas when they appeared in various ways in the world as their last existence as bodhisattvas.

source: རིགས་ཀྱི་བུ་ཁོ་མོ་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བཅོམ་ལྡན་འདས་རྣམ་པར་སྣང་མཛད་ཀྱི་བྱང་ཆུབ་སེམས་དཔའི་སྐྱེ་བའི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་དག་ཏུ་ཡུམ་དུ་གྱུར་པ།
en: “Noble one, in this world realm I have been the mother who manifested the miraculous bodhisattva birth of the Bhagavat Vairocana.

source: དེ་བཞིན་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་ལོག་པ་དད་སེལ་དང་། གསེར་ཐུབ་དང་བསོད་སྐྱབས་ཀྱི་ཡུམ་དུ་ཡང་གྱུར་ཏོ། །
en: In the same way, I was the mother of the tathāgatas Krakucchanda, Kanaka­muni, and Kāśyapa.

source: དེ་བཞིན་དུ་མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་བསྐལ་བ་བཟང་པོ་བ་རྣམས་ཀྱི་ཡང་ཡུམ་དུ་འགྱུར་ཏེ།
en: In the same way, I will be the mother of all the future tathāgatas in this Bhadra kalpa.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དགའ་ལྡན་གྱི་གནས་ན་བཞུགས་ཤིང་ཤི་འཕོ་ཡོངས་སུ་སྟོན་པའི་དུས་ལ་བབ་པ་དང་། འོད་ཟེར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་སྐྱེ་བར་འབྱུང་ཞིང་མངལ་ན་བཞུགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་སྟོན་པའི་འོད་བཀྱེ་ནས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚུལ་དང་གཞི་རབ་ཏུ་སྣང་བར་བྱས་ཏེ།
en: Thus, when the time comes for the bodhisattva Maitreya, who dwells in the Tuṣita palace, to manifest passing away, he will radiate the light ray of the lights that reveal the miraculous event of the birth, appearance, and dwelling in a womb of all bodhisattvas.

source: ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་དང་། གཞི་ཇི་སྙེད་ཅིག་ཏུ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་མྱིའི་འཇིག་རྟེན་གྱི་མིའི་དབང་པོའི་རིགས་སུ་ཚེར་སྐྱེ་བ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་གདུལ་བར་བྱ་བ་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་དུའང་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་ཡུམ་དུ་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པའི་ཡུམ་དུ་ཇི་ལྟར་འགྱུར་བ་དེ་བཞིན་དུ་བྱམས་པའི་འོག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ། སེང་གེ་དང་། དེ་བཞིན་དུ་རབ་ཏུ་སྣང་བ་དང་། དཔལ་དང་སྤྱན་བཟང་པོ་དང་། མེ་ཏོག་དང་། མེ་ཏོག་དཔལ་དང་། རྒྱས་པ་དང་། རྒྱལ་དང་། ཐུགས་བཟང་པོ་དང་། རྡོ་རྗེ་དང་། རྡུལ་དང་བྲལ་བ་དང་། ཟླ་བ་སྒྲོན་མ་འཛིན་པ་དང་། གྲགས་པ་དང་། རྡོ་རྗེ་དག་པ་དང་། དོན་གཅིག་ཏུ་སྟོན་པ་དང་། མི་དཀར་ཡན་ལག་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་། རིན་པོ་ཆེ་འོད་འཕྲོ་བའི་རི་བོ་དང་། སྒྲོན་མ་ཆེན་པོ་འཛིན་པ་དང་། པད་མོ་དམ་པ་དང་། སྒྲ་རྣམ་པར་གྲགས་པ་དང་། ཡོན་ཏན་དཔག་ཏུ་མེད་པ་མངའ་བ་དང་། མར་མེའི་དཔལ་དང་། ཡན་ལག་རྣམ་པར་བརྒྱན་པ་དང་། ལེགས་པར་བཞུད་པ་དང་། བྱམས་པའི་དཔལ་དང་། སྤྲུལ་བ་བཟང་པོ་དང་། གནས་དང་བྲལ་བ་དང་། གཟི་བརྗིད་འབར་བ་དང་། གསུང་མཐའ་ཡས་པ་དང་། ལེན་པ་མེད་པའི་སྤྱན་དང་། ལེན་པ་མེད་པའི་མུ་ཁྱུད་དང་། ཡིད་གཉིས་རྣམ་པར་སེལ་བ་དང་། ཡོངས་སུ་དག་པ་དང་། འོད་ཤིན་ཏུ་ཡངས་པ་དང་། གྲགས་པ་དག་པས་བྱུང་བ་དང་། སྤྲིན་གྱི་དཔལ་དང་། གཙུག་ཕུད་རྣམ་པར་མཛེས་པ་དང་། ཤིང་གི་རྒྱལ་པོ་དང་། རིན་པོ་ཆེའི་དཀྱིལ་འཁོར་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱིས་རྣམ་པར་བརྒྱན་པའི་ཁ་དོག་དང་། བློ་གྲོས་རྒྱ་མཚོ་དང་། རིན་པོ་ཆེ་བཟང་པོ་དང་། སྟོབས་ལ་ཐུབ་པ་མེད་པ་དང་། དགོངས་པ་ཡོངས་སུ་རྫོགས་པ་དང་། དབང་ཕྱུག་ཆེན་པོ་དང་། དབང་པོའི་དཔལ་དང་། མེའི་དཔལ་དང་། མཆོག་གི་དཔལ་དང་། ཙན་དན་གྱི་སྤྲིན་དང་། མི་དཀར་རིངས་པོའི་སྤྱན་དང་། བློ་གྲོས་དམ་པ་དང་། བློ་གྲོས་རྣམ་པར་བསྒོམས་པ་དང་། སྒྲུབ་པའི་རྒྱལ་པོ་དང་། སྦྱོང་བའི་རྒྱལ་པོ་དང་། རྡོ་རྗེ་བློ་གྲོས་དང་། རྣམ་པར་བརྒྱན་པ་དང་། ཕུན་སུམ་སྣ་ཚོགས་དང་། ཟེ་བ་དགའ་བ་དང་། དབང་ཕྱུག་ལྷ་དང་། གཙུག་ཏོར་དཔལ་དང་། ཡེ་ཤེས་རྡོ་རྗེའི་རི་བོ་དང་། དཔལ་གྱི་སྙིང་པོ་དང་། གསེར་གྱི་དྲ་བས་སྐུ་རྣམ་པར་བརྒྱན་པ་དང་། ཤིན་ཏུ་རྣམ་པར་ཕྱེ་བ་དང་། དབང་ཕྱུག་ལྷ་དང་། དབང་ཆེན་ལྷ་དང་། མི་དམིགས་པའི་དཔལ་དང་། རྣམ་པར་དག་པས་དགྱེས་པ་དང་། འོད་འཕྲོ་མངའ་བ་དང་། ཆུའི་དཔལ་དང་། རྣམ་དག་བློ་གྲོས་དང་། ཐེག་པ་དམ་པ་དང་། མ་ཉམས་པའི་ཡོན་ཏན་འབྱུང་བ་དང་། དགྲ་ལས་དབེན་པ་དང་། གསུང་སྒྲོག་པ་དང་། དབང་དུ་གྱུར་པའི་ཡོན་ཏན་གཟི་བརྗིད་དང་། རྣམ་པར་སྣང་མཛད་དཔལ་དང་། དྲི་ཞིམ་པོའི་ལོངས་སྤྱོད་དང་། དྲི་ཞིམ་པོ་རྣམ་པར་ཕྱེ་བ་དང་། ཡན་ལག་རྣམ་པར་ཕྱེ་བ་དང་། ས་ག་བཟང་པོ་དང་། ཞལ་ནས་སྤོས་ཐམས་ཅད་འོད་དུ་འཕྲོ་བ་དང་། རྡོ་རྗེ་རིན་པོ་ཆེས་རྣམ་པར་བརྒྱན་པ་དང་། རབ་ཏུ་བཞད་པའི་སྤྱན་དང་། འདོད་ཆགས་རྡུལ་བཅོམ་དང་། སྐུ་མཆོག་ཏུ་འཁྲུངས་པ་དང་། ལྷའི་དབྱིག་དང་། རླབས་ཆེན་ལྷ་དང་། འགོག་པར་གཞོལ་བ་དང་། ཐུགས་རྣམ་པར་སངས་རྒྱས་པ་དང་། རྡུལ་རྣམ་པར་བསྩལ་པ་དང་། འོད་འཕྲོ་མངའ་ཆེན་དང་། ཉེ་བར་ཞི་བ་མངའ་བ་དང་། ས་གའི་ལྷ་དང་། རྡོ་རྗེ་རི་བོ་དང་། ཡེ་ཤེས་འོད་འཕྲོ་འབར་བའི་སྐུ་དང་། བདེ་མཛད་བ་དང་། བསྐྲུན་པའི་སྟག་དང་། དགེ་བ་ཡོངས་སུ་རྫོགས་པ་དང་། གྲགས་པ་ཡིད་དུ་འོང་བས་བཟང་བ་དང་། མཐུས་རྣམ་པར་གནོན་པ་དང་། དོན་དམ་པ་རྣམ་པར་གནོན་པ་དང་། ཞི་བའི་འོད་ཟེར་དང་། གཅིག་ཏུ་འཕགས་པ་དང་། དབྱངས་ཟབ་མོ་དང་། སའི་བདག་པོ་དང་། དཔག་ཏུ་མེད་པ་དང་། དབྱངས་ཀྱི་དཔལ་དང་། རྣམ་པར་གྲགས་པ་དང་། ལོངས་སྤྱོད་འཐུན་པ་དང་། ལོངས་སྤྱོད་ཚོགས་པ་དང་། སྨན་པའི་དམ་པ་དང་། ཡོན་ཏན་ཟླ་བ་དང་། བཞད་པའི་གཟི་བརྗིད་དང་། ཡོན་ཏན་བསྩགས་པ་དང་། ཟླ་བ་འཕགས་པ་དང་། ཉི་མའི་ལྷ་དང་། འཇིགས་པར་གྲགས་པ་དང་། འོད་ཟེར་གྱི་ཞལ་དང་། སཱ་ལའི་དབང་པོའི་ལྷུན་དང་། གྲགས་པ་དང་། སྨན་གྱི་རྒྱལ་པོ་དང་། རིན་ཆེན་མཆོག་དང་། བློ་གྲོས་རྡོ་རྗེ་དང་། དཀར་པོའི་དཔལ་དང་། གཞི་ཤིན་ཏུ་སྦྱངས་པ་དང་། རིན་ཅེན་རྒྱལ་པོ་དང་། གྲགས་པ་ཆེན་པོ་དང་། ཤུགས་དྲག་འཛིན་པ་དང་། མི་དཔོགས་འོད་དང་། འོད་འཕྲོ་ཆེན་པོས་བཞུགས་པ་དང་། དོན་ཡོད་པའི་ཆོས་ལ་མངའ་བ་དང་། བརྩོན་འགྲུས་མ་ཉམས་པ་དང་། དག་པའི་ལྷ་དང་། འོད་བརྟན་པ་དང་། ཀུན་གྱི་བཤེས་གཉེན་དང་། རྣམ་པར་གྲོལ་བའི་དབྱངས་དང་། རྣམ་པར་བསྒྲགས་པའི་རྒྱལ་པོ་དང་། ཚིག་གཅོད་པ་དང་། ཙམ་པ་ཀ་དྲི་མ་མེད་པའི་འོད་དང་། ཁ་ན་མ་ཐོ་བ་མི་མངའ་བ་དང་། ཟླ་བ་རྣམ་པར་འཕགས་པ་དང་། སྒྲོན་མ་འཛིན་པ་དང་། སྐུ་རྣམ་པར་མཛེས་པ་དང་། བརྗོད་དུ་མེད་པར་འཕགས་པ་དང་། འགྲོ་བའི་བཤེས་གཉེན་དང་། འོད་ཟེར་མང་པོ་དང་། དབྱངས་ཀྱི་ཡན་ལག་དཔའ་བོ་དང་། ཆུའི་ལྷའི་སྤྱན་དང་། མོས་པའི་བློ་གྲོས་མངའ་བའི་གཟི་བརྗིད་དང་། མེ་ཏོག་ཀུན་དའི་དཔལ་དང་། མཆོད་པའི་ཟླ་བ་དང་། བློ་མི་མངའ་བ་དང་། ཆགས་པ་མི་མངའ་བ་དང་། མི་དམིགས་པའི་བློ་གྲོས་དང་། ཕུང་པོ་བསྩགས་པ་དང་། ངན་སོང་རབ་ཏུ་འཇོམས་པ་དང་། མེ་ཏོག་དམ་པ་དང་། སེང་གེ་རྣམ་པར་སྒྲོག་པ་དང་། དོན་མི་དམའ་བ་དང་། བསྒྲིབས་པ་མེད་པར་གཟིགས་པ་དང་། ཕ་རོལ་གྱི་ཚོགས་འཇོམས་པ་དང་། རླུང་གི་མུ་ཁྱུད་དང་། སྙིང་བོ་མི་གཡོ་བ་དང་། སྙིང་པོ་བཟང་པོ་དང་། གཞན་གྱིས་མི་ཐུབ་པའི་རི་བོ་དང་། མི་གནས་ཡེ་ཤེས་དང་། མཐའ་ཡས་བཞུགས་པ་དང་། གཡུལ་དུ་བརྟན་པ་དང་། སྤྱོད་པས་གྲུབ་པ་དང་། བླ་མས་བོན་པ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། རྗེས་སུ་འཛིན་པའི་ཟླ་བ་དང་། ལྷུན་མི་གཡོ་བ་དང་། ཐུགས་དྲག་པོ་དང་། ཐུགས་བརྩེ་བའི་བློ་གྲོས་དང་། ཤིན་ཏུ་མཐོ་འཛིན་པ་དང་། འོད་ཟེར་མུ་ཁྱུད་དང་། མཚན་དཔེ་མེད་པ་དང་། གཟི་བརྗིད་མཉམ་པ་དང་། ཐམས་ཅད་ཁ་དོག་དང་། མཚན་མ་མེད་པའི་ཤེས་རབ་དང་། མི་གཡོ་བའི་ལྷ་དང་། བསམ་གྱིས་མི་ཁྱབ་པའི་དཔལ་དང་། རྣམ་པར་ཐར་བའི་ཟླ་བ་དང་།
en: The light will go throughout the lands and ways of the entire realm of phenomena and will manifest as that bodhisattva Maitreya who will be born in a human world in the family of a lord of humans in all the lands and ways of the entire realm of phenomena in order to guide beings, and I will be the mother of all those bodhisattvas.

source: བླ་ན་མེད་པའི་རྒྱལ་པོ་དང་། ཟླ་བའི་ཕུང་པོ་དང་། མཆོད་པའི་ཚངས་པ་དང་། སྤྱན་མི་འགྱུར་བ་དང་། བྱམས་པའི་རིགས་དང་། ཕྲིན་ལས་འཕགས་པ་དང་། གཉེར་བའི་ཆོས་ཀྱི་བློ་གྲོས་དང་། བླ་ན་མེད་པའི་དཔལ་དང་། ཚངས་པའི་ལྷ་དང་། ཡོན་ཏན་བསམ་གྱིས་མི་ཁྱབ་པའི་འོད་དང་། བླ་ན་མེད་པའི་ཆོས་ཀྱི་སྤྱོད་ཡུལ་དང་།
en: “Just as I will be the mother of the bodhisattva Maitreya, in the same way, after Maitreya’s attainment of the highest, complete enlightenment of buddhahood, I will be the mother of Siṃha, Pradyota, Ketu, Sunetra, Kusuma, Kusumaśrī, Tiṣya, Puṣya, Sumanas, Vajra, Viraja, Candrolkā­dhārin, Yaśas, Vajraśuddha, Ekārtha­darśin, Sitāṅga, Pāraṃgata, Ratnārciḥ­parvata, Maholkādhārin, Padmottara, Vighuṣṭaśabda, Aparimita­guṇa­dharma, Dīpaśrī, Vibhūṣitāṅga, Suprayāṇa, Maitraśrī, Nirmita, Aniketa, Jvalitatejas, Anantaghoṣa, Aninetra, Aninema, Vimativikiraṇa, Pariśuddha, Suviśālābha, Yaśaḥ­śuddhodita, Meghaśrī, Vicitra­bhūta, Druma­rāja, Sarva­ratna­vicitra­varṇa­maṇi­kuṇḍala, Sāgara­mati, Śubharatna, Anihatamalla, Paripūrṇa­manoratha, Maheśvara, Indraśrī, Agniśrī, Pravaraśrī, Candana­megha, Sitaviśālākṣa, Śreṣṭhamati, Vibhāvitamati, Avaropaṇarāja, Uttāpana­rāja­mati, Vajramati, Vibhūṣita, Vibhūti, Keśaranandin, Īśvaradeva, Īśvara, Uṣṇīṣa­śrī, Vajra­jñāna­parvata, Śrīgarbha, Kanaka­jāla­kāya­vibhūṣita, Suvibhakta, Īśvaradeva, Mahendradeva, Anilaśrī, Viśuddhanandin, Arciṣmat, Varuṇaśrī, Viśuddhamati, Agrayāna, Nihita­guṇodita, Arigupta, Vākyanuda, Vaśībhūta, Guṇa­tejas, Vairocanaketu, Vibhavagandha, Vibhāvana­gandha, Vibhaktāṅga, Suviśākha, Sarva­gandhārci­mukha, Vajra­maṇi­vicitra, Prahasitanetra, Nihata­rāga­rajas, Pravṛddha­kāya­rāja, Vāsudeva, Udāradeva, Nirodhanimna, Vibuddhi, Dhūtarajas, Arcirmahendra, Upaśamavat, Viśākhadeva, Vajragiri, Jñānārci­jvalita­śarīra, Kṣemaṃkara, Aupagama, Śārdūla, Paripūrṇa­śubha, Rucira­bhadra­yaśas, Parākrama­vikrama, Paramārtha­vikrāmin, Śānta­raśmi, Ekottara, Gambhīreśvara, Bhūmipati, Amita, Ghoṣaśrī, Viśiṣṭa, Vibhūtapati, Vibhūtabhūta, Vaidyottama, Guṇa­candra, Praharṣita­tejas, Guṇa­saṃcaya, Candrodgata, Bhāskara­deva, Bhīṣmayaśas, Raśmi­mukha, Śālendra­skandha, Yaśas, Auṣadhirāja, Ratnavara, Mativajra, Sitaśrī, Nirghautālaya, Maṇirāja, Mahāyaśas, Vegadhārin, Amitābha, Mahāsanārcis, Moha­dharmeśvara, Nihata­dhīra, Devaśuddha, Dṛḍhaprabha, Viśvāmitra, Vimuktighoṣa, Vinarditarāja, Vākyaccheda, Campaka­vimala­prabha, Anavadya, Viśiṣṭacandra, Ulkādhāriṇ, Vicitra­gātra, Anabhilāpyodgata, Jaganmitra, Prabhūta­raśmi, Svarāṅgaśūra, Varuṇākṣa, Dhṛtamatitejas, Kundaśrī, Arciścandra, Anihitamati, Anunayavigata, Anilambha­mati, Upacitaskandha, Apāya­pramathana, Adīna­kusuma, Siṃha­vinardita, Anihānārtha, Anāvaraṇa­darśin, Para­gaṇa­mathana, Anilanema, Akampitagarbha, Śobhanasāgara, Aparājita­meru, Anilayajñāna, Anantāsana, Ayudhiṣṭhira, Caryāgata, Uttaradatta, Atyanta­candra­mas, Anugrahacandra, Acalaskandha, Agrasānumati, Anugrahamati, Abhyuddhara, Arcitanama, Anupagamanāman, Nihata­tejas, Viśvavarṇa, Animittaprajña, Acaladeva, Acintya­śrī, Vimokṣacandra, Anuttara­rāja, Candra­skandha, Arcitabrahman, Akampyanetra, Anunayagātra, Abhyudgata­karman, Anudharmamati, Anuttara­śrī, Brahmadeva, Acintya­guṇa­prabha, Anuttara­dharma­gocara, Aparyanta­bhadra, Anurūpasvara, and the bodhisattva Abhyuccadeva.
